{
  "_description": "Reflexion entries are self-assessments by the agent after a correction. They get injected into the system prompt on future executions of the same skill, enabling the agent to learn from mistakes.",
  "entries": [
    {
      "reflexion_id": "REFL-001",
      "correction_id": "CORR-001",
      "skill": "wealth/suggest-allocation",
      "created_at": "2026-02-12T09:25:00Z",
      "mistake": "Applied uniform moderate risk profile across all markets/currencies when user had a time-sensitive goal requiring aggressive India equity allocation.",
      "root_cause": "Treated risk_profile as a single global value. Did not consider per-market or per-goal risk differentiation.",
      "rule": "When a user has goals with different timelines and currency requirements, assess risk per-goal and per-market, not just overall. A moderate investor can be aggressive in one market and conservative in another.",
      "applies_when": "User has multiple goals across different currencies OR explicitly mentions wanting different risk levels for different holdings.",
      "confidence": 0.9,
      "validated_by_test": true
    },
    {
      "reflexion_id": "REFL-002",
      "correction_id": "CORR-002",
      "skill": "fincrime/triage-alerts",
      "created_at": "2026-02-14T07:35:00Z",
      "mistake": "Classified an alert as Quick Approve based on low amount and repeat beneficiary, without checking if the beneficiary was receiving from multiple users.",
      "root_cause": "Evaluated alert in isolation. Did not perform cross-user beneficiary analysis before classification.",
      "rule": "ALWAYS check beneficiary_id across all users in the batch and recent history before any Quick Approve classification. A beneficiary receiving from 3+ unique users in 7 days MUST go to Needs Investigation regardless of individual transaction characteristics.",
      "applies_when": "Any triage classification, especially Quick Approve.",
      "confidence": 1.0,
      "validated_by_test": true
    }
  ]
}
